----------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/mansanch/Preliminars_Descriptives.log
  log type:  text
 opened on:  29 Jul 2017, 21:10:06

. *
. sum persnr

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      persnr |  41905958    670294.7    387478.5          1    1341982

. sum year

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        year |  41905958    2000.028    10.80469       1975       2014

. foreach i of numlist 1975 1985 1995 2005 2014 {
  2. preserve
  3. keep if year==`i'
  4. egen indivnr=group(persnr)
  5. sum indivnr
  6. restore
  7. }
(41485465 observations deleted)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     indivnr |    420493    183659.1      106018          1     367412
(41305410 observations deleted)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     indivnr |    600548    213538.3    123106.1          1     426720
(41198091 observations deleted)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     indivnr |    707867    252809.7    146016.8          1     505745
(40792630 observations deleted)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     indivnr |   1113328    290018.1    167612.7          1     580830
(40063904 observations deleted)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     indivnr |   1842054    292698.4    169259.4          1     587064

. *
. tabstat counter_diff_estab, by(year) statistics(mean min max n)

Summary for variables: counter_diff_estab_id
     by categories of: year 

    year |      mean       min       max         N
---------+----------------------------------------
    1975 |  1.098545         1        20    419047
    1976 |  1.306545         1        32    447725
    1977 |  1.501197         1        34    457160
    1978 |  1.672412         1        28    462447
    1979 |  1.844742         1        34    478127
    1980 |  1.987058         1        48    486080
    1981 |  2.067462         1        52    481057
    1982 |  2.108918         1        54    471270
    1983 |  2.169029         1        59    466193
    1984 |  2.268779         1       114    479434
    1985 |  2.387531         1       114    485767
    1986 |    2.4934         1       124    492027
    1987 |  2.585391         1       128    499593
    1988 |  2.694066         1       128    507501
    1989 |  2.833097         1       135    526863
    1990 |  2.935057         1       135    557107
    1991 |   2.96384         1       148    582383
    1992 |  3.037402         1       149    573736
    1993 |   3.09306         1        86    561702
    1994 |  3.186225         1        84    551951
    1995 |  3.283373         1        84    554163
    1996 |  3.371676         1        84    559301
    1997 |  3.473833         1        84    599929
    1998 |  3.598945         1        86    598616
    1999 |   3.73198         1        90    772186
    2000 |  3.934328         1        91    807770
    2001 |  4.066104         1        89    821951
    2002 |  4.186956         1        84    806618
    2003 |  4.302855         1        84    902741
    2004 |  4.499435         1        84    877130
    2005 |  4.629526         1        91    903472
    2006 |  4.837497         1        85    952063
    2007 |  4.959839         1        89    974875
    2008 |  5.109949         1        92    978118
    2009 |  5.202622         1        93    997503
    2010 |  5.382691         1        96   1013132
    2011 |  5.532803         1       102   1008248
    2012 |  5.610875         1       103    999332
    2013 |  5.650829         1       105   1022078
    2014 |  5.721032         1       106    996987
---------+----------------------------------------
   Total |  3.835194         1       149  2.71e+07
--------------------------------------------------

. *
. tabstat source if source==1, by(year) statistics(n)

Summary for variables: source
     by categories of: year 

    year |         N
---------+----------
    1975 |    419095
    1976 |    439489
    1977 |    449782
    1978 |    450825
    1979 |    470264
    1980 |    477409
    1981 |    474997
    1982 |    465904
    1983 |    458790
    1984 |    473561
    1985 |    476009
    1986 |    487674
    1987 |    494761
    1988 |    502228
    1989 |    521461
    1990 |    551432
    1991 |    575198
    1992 |    564371
    1993 |    552166
    1994 |    539019
    1995 |    542409
    1996 |    545311
    1997 |    585106
    1998 |    581901
    1999 |    760119
    2000 |    796943
    2001 |    809846
    2002 |    791717
    2003 |    889767
    2004 |    867599
    2005 |    889908
    2006 |    933214
    2007 |    964160
    2008 |    966884
    2009 |    986394
    2010 |   1002498
    2011 |    997663
    2012 |    988085
    2013 |   1013897
    2014 |    996987
---------+----------
   Total |  2.68e+07
--------------------

. tabstat source if source==2, by(year) statistics(n)

Summary for variables: source
     by categories of: year 

    year |         N
---------+----------
    1975 |      1398
    1976 |     30279
    1977 |     67695
    1978 |     44475
    1979 |     45344
    1980 |     62898
    1981 |     79349
    1982 |     95730
    1983 |    108357
    1984 |    109297
    1985 |    112802
    1986 |    111190
    1987 |    110953
    1988 |    110097
    1989 |    107374
    1990 |    106186
    1991 |    107207
    1992 |    119526
    1993 |    138373
    1994 |    146870
    1995 |    147647
    1996 |    163813
    1997 |    191851
    1998 |    209102
    1999 |    216132
    2000 |    219175
    2001 |    215282
    2002 |    253170
    2003 |    292806
    2004 |    322605
    2005 |    173331
    2006 |    162586
    2007 |    134501
    2008 |    134116
    2009 |    166039
    2010 |    143982
    2011 |    117545
    2012 |    118449
    2013 |    124997
    2014 |    122283
---------+----------
   Total |   5444812
--------------------

. tabstat source if source==3, by(year) statistics(n)

Summary for variables: source
     by categories of: year 

    year |         N
---------+----------
    1997 |    277506
    1998 |    290162
    1999 |    316228
    2000 |    328897
    2001 |    329726
    2002 |    364435
    2003 |    427590
    2004 |    485331
    2007 |    503261
    2008 |    500578
    2009 |    544296
    2010 |    522257
    2011 |    466209
    2012 |    450547
    2013 |    444003
    2014 |    439966
---------+----------
   Total |   6690992
--------------------

. tabstat source y(year) statistics(n)
factor variables and time-series operators not allowed
r(101);

end of do-file

r(101);

