----------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/mansanch/Preliminars_b.log
  log type:  text
 opened on:  29 Jul 2017, 22:44:15

. *
. tabstat source if source==1, by(year) statistics(n)

Summary for variables: source
     by categories of: year 

    year |         N
---------+----------
    1975 |    419094
    1976 |    439490
    1977 |    449785
    1978 |    450826
    1979 |    470263
    1980 |    477412
    1981 |    474998
    1982 |    465901
    1983 |    458790
    1984 |    473562
    1985 |    476008
    1986 |    487671
    1987 |    494760
    1988 |    502225
    1989 |    521454
    1990 |    551442
    1991 |    575201
    1992 |    564371
    1993 |    552167
    1994 |    539019
    1995 |    542411
    1996 |    545311
    1997 |    585106
    1998 |    581905
    1999 |    760119
    2000 |    796934
    2001 |    809857
    2002 |    791708
    2003 |    889768
    2004 |    867601
    2005 |    889907
    2006 |    933222
    2007 |    964160
    2008 |    966878
    2009 |    986397
    2010 |   1002501
    2011 |    997667
    2012 |    988078
    2013 |   1013903
    2014 |    996990
---------+----------
   Total |  2.68e+07
--------------------

. tabstat source if source==2, by(year) statistics(n)

Summary for variables: source
     by categories of: year 

    year |         N
---------+----------
    1975 |      1398
    1976 |     30279
    1977 |     67695
    1978 |     44475
    1979 |     45344
    1980 |     62898
    1981 |     79348
    1982 |     95730
    1983 |    108357
    1984 |    109297
    1985 |    112802
    1986 |    111190
    1987 |    110953
    1988 |    110097
    1989 |    107374
    1990 |    106186
    1991 |    107207
    1992 |    119526
    1993 |    138373
    1994 |    146870
    1995 |    147647
    1996 |    163813
    1997 |    191851
    1998 |    209102
    1999 |    216132
    2000 |    219176
    2001 |    215284
    2002 |    253173
    2003 |    292806
    2004 |    322605
    2005 |    173331
    2006 |    162586
    2007 |    134501
    2008 |    134116
    2009 |    166039
    2010 |    143982
    2011 |    117545
    2012 |    118449
    2013 |    124997
    2014 |    122283
---------+----------
   Total |   5444817
--------------------

. tabstat source if source==3, by(year) statistics(n)

Summary for variables: source
     by categories of: year 

    year |         N
---------+----------
    1997 |    277506
    1998 |    290162
    1999 |    316230
    2000 |    328897
    2001 |    329726
    2002 |    364436
    2003 |    427590
    2004 |    485331
    2007 |    503261
    2008 |    500578
    2009 |    544296
    2010 |    522257
    2011 |    466209
    2012 |    450547
    2013 |    444003
    2014 |    439966
---------+----------
   Total |   6690995
--------------------

. tabstat source if source==4, by(year) statistics(n)

Summary for variables: source
     by categories of: year 

    year |         N
---------+----------
    2007 |    326034
    2008 |    317923
    2009 |    316287
    2010 |    320805
    2011 |    306400
    2012 |    295611
    2013 |    279224
    2014 |    282818
---------+----------
   Total |   2445102
--------------------

. *
. tabstat female, by(year) statistics(mean n)

Summary for variables: female
     by categories of: year 

    year |      mean         N
---------+--------------------
    1975 |  .3450886    420492
    1976 |  .3456614    478069
    1977 |  .3483157    525374
    1978 |  .3472755    508743
    1979 |  .3549971    524686
    1980 |  .3581904    549811
    1981 |  .3590853    561343
    1982 |  .3561388    568183
    1983 |  .3559319    576245
    1984 |  .3555517    590907
    1985 |  .3556624    600547
    1986 |  .3657589    604934
    1987 |  .3727772    612406
    1988 |  .3814035    619622
    1989 |  .3899836    636519
    1990 |  .3977849    665352
    1991 |  .4011062    691742
    1992 |  .4052331    695533
    1993 |  .4040032    702888
    1994 |  .4046145    702649
    1995 |  .4073508    707869
    1996 |  .4075028    730476
    1997 |  .3978496   1073672
    1998 |  .4044731   1104961
    1999 |  .4401557   1310450
    2000 |  .4467564   1361469
    2001 |  .4454474   1372355
    2002 |  .4410106   1429723
    2003 |  .4458819   1628539
    2004 |  .4392463   1689765
    2005 |  .4743916   1113327
    2006 |  .4773452   1147172
    2007 |  .4653345   1941369
    2008 |  .4689723   1935803
    2009 |  .4581645   2029594
    2010 |   .460277   2005436
    2011 |  .4687375   1903737
    2012 |  .4725726   1868754
    2013 |  .4694709   1873411
    2014 |  .4689958   1842057
---------+--------------------
   Total |  .4301647  4.19e+07
------------------------------

. tab year_birth

    Year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1913 |      3,780        0.01        0.01
       1914 |      7,847        0.02        0.03
       1915 |     10,875        0.03        0.05
       1916 |     11,810        0.03        0.08
       1917 |     14,568        0.03        0.12
       1918 |     18,006        0.04        0.16
       1919 |     33,002        0.08        0.24
       1920 |     50,298        0.12        0.36
       1921 |     60,659        0.14        0.50
       1922 |     65,145        0.16        0.66
       1923 |     71,761        0.17        0.83
       1924 |     79,169        0.19        1.02
       1925 |     95,421        0.23        1.25
       1926 |    107,277        0.26        1.50
       1927 |    116,656        0.28        1.78
       1928 |    139,516        0.33        2.11
       1929 |    147,314        0.35        2.47
       1930 |    165,876        0.40        2.86
       1931 |    170,655        0.41        3.27
       1932 |    173,050        0.41        3.68
       1933 |    187,313        0.45        4.13
       1934 |    233,033        0.56        4.68
       1935 |    263,740        0.63        5.31
       1936 |    281,529        0.67        5.99
       1937 |    321,622        0.77        6.75
       1938 |    365,400        0.87        7.62
       1939 |    420,522        1.00        8.63
       1940 |    454,366        1.08        9.71
       1941 |    444,335        1.06       10.77
       1942 |    394,649        0.94       11.71
       1943 |    418,333        1.00       12.71
       1944 |    428,698        1.02       13.74
       1945 |    351,408        0.84       14.57
       1946 |    430,995        1.03       15.60
       1947 |    507,907        1.21       16.82
       1948 |    554,430        1.32       18.14
       1949 |    624,821        1.49       19.63
       1950 |    689,624        1.65       21.27
       1951 |    706,302        1.69       22.96
       1952 |    778,022        1.86       24.82
       1953 |    773,384        1.85       26.66
       1954 |    827,673        1.98       28.64
       1955 |    848,102        2.02       30.66
       1956 |    917,644        2.19       32.85
       1957 |    974,748        2.33       35.18
       1958 |    982,955        2.35       37.52
       1959 |  1,048,129        2.50       40.02
       1960 |  1,055,353        2.52       42.54
       1961 |  1,097,205        2.62       45.16
       1962 |  1,121,589        2.68       47.84
       1963 |  1,138,002        2.72       50.55
       1964 |  1,155,977        2.76       53.31
       1965 |  1,125,252        2.69       56.00
       1966 |  1,121,767        2.68       58.67
       1967 |  1,074,848        2.56       61.24
       1968 |  1,043,091        2.49       63.73
       1969 |    998,916        2.38       66.11
       1970 |    920,802        2.20       68.31
       1971 |    867,797        2.07       70.38
       1972 |    795,353        1.90       72.28
       1973 |    722,459        1.72       74.00
       1974 |    721,283        1.72       75.72
       1975 |    696,474        1.66       77.38
       1976 |    704,157        1.68       79.06
       1977 |    689,488        1.65       80.71
       1978 |    691,463        1.65       82.36
       1979 |    685,743        1.64       84.00
       1980 |    706,334        1.69       85.68
       1981 |    698,521        1.67       87.35
       1982 |    668,490        1.60       88.94
       1983 |    611,805        1.46       90.40
       1984 |    572,784        1.37       91.77
       1985 |    516,451        1.23       93.00
       1986 |    504,418        1.20       94.21
       1987 |    473,788        1.13       95.34
       1988 |    431,569        1.03       96.37
       1989 |    383,291        0.91       97.28
       1990 |    333,394        0.80       98.08
       1991 |    263,933        0.63       98.71
       1992 |    201,211        0.48       99.19
       1993 |    147,251        0.35       99.54
       1994 |     98,809        0.24       99.77
       1995 |     56,531        0.13       99.91
       1996 |     28,961        0.07       99.98
       1997 |      9,055        0.02      100.00
------------+-----------------------------------
      Total | 41,905,984      100.00

. tabstat german, by(year) statistics(mean n)

Summary for variables: german
     by categories of: year 

    year |      mean         N
---------+--------------------
    1975 |  .8856527    415550
    1976 |  .8891779    443729
    1977 |  .8936562    452918
    1978 |  .8959536    458709
    1979 |   .895394    473338
    1980 |  .8935888    480983
    1981 |  .9008546    477057
    1982 |  .9052121    496941
    1983 |  .9067475    566505
    1984 |  .9101451    582428
    1985 |  .9171844    592002
    1986 |  .9182305    595797
    1987 |  .9174918    602837
    1988 |    .91595    609435
    1989 |  .9127501    624287
    1990 |  .9101564    647770
    1991 |   .900845    652060
    1992 |  .8906403    656595
    1993 |  .8847106    662099
    1994 |  .8825135    660612
    1995 |  .8822967    663677
    1996 |  .8821081    680208
    1997 |  .8699031    964612
    1998 |  .8735851    983563
    1999 |  .8708744   1168715
    2000 |  .8717105   1205796
    2001 |  .8736825   1206856
    2002 |  .8732476   1245870
    2003 |  .8742582   1421095
    2004 |  .8715766   1465200
    2005 |  .8867474   1005831
    2006 |  .8840999   1038877
    2007 |  .8534645   1683258
    2008 |   .850197   1679239
    2009 |  .8486451   1761674
    2010 |  .8476723   1748749
    2011 |  .8425813   1668379
    2012 |  .8361911   1642750
    2013 |  .8302278   1656143
    2014 |  .8197939   1638008
---------+--------------------
   Total |  .8710405  3.77e+07
------------------------------

. tabstat requirement, by(year) statistics(mean min max n)

Summary for variables: requirement
     by categories of: year 

    year |      mean       min       max         N
---------+----------------------------------------
    1975 |  2.099331         1         4    411252
    1976 |  2.098738         1         4    440011
    1977 |  2.106887         1         4    448932
    1978 |  2.110648         1         4    454170
    1979 |  2.113635         1         4    470297
    1980 |  2.117828         1         4    480235
    1981 |  2.123343         1         4    475982
    1982 |  2.127805         1         4    466577
    1983 |  2.130661         1         4    461631
    1984 |  2.131983         1         4    474371
    1985 |   2.13668         1         4    480406
    1986 |  2.141976         1         4    486554
    1987 |    2.1455         1         4    493971
    1988 |  2.149839         1         4    501678
    1989 |  2.155123         1         4    520561
    1990 |  2.153968         1         4    549478
    1991 |  2.156854         1         4    561675
    1992 |  2.163157         1         4    565043
    1993 |  2.171251         1         4    554174
    1994 |  2.174986         1         4    544374
    1995 |  2.182542         1         4    545832
    1996 |  2.190478         1         4    550204
    1997 |  2.181106         1         4    759672
    1998 |  2.193882         1         4    775955
    1999 |  2.150853         1         4    968255
    2000 |  2.147229         1         4   1017349
    2001 |  2.157438         1         4   1037709
    2002 |  2.164612         1         4   1057684
    2003 |  2.110546         1         4   1285256
    2004 |  2.086158         1         4   1457291
    2005 |   2.12156         1         4   1033791
    2006 |  2.122292         1         4   1064553
    2007 |  2.072817         1         4   1390411
    2008 |  2.063342         1         4   1400659
    2009 |  2.052824         1         4   1496386
    2010 |  2.064255         1         4   1471644
    2011 |  2.017793         1         4   1286048
    2012 |  1.963335         1         4   1412993
    2013 |  1.967256         1         4   1464860
    2014 |  1.967342         1         4   1438206
---------+----------------------------------------
   Total |  2.098926         1         4  3.28e+07
--------------------------------------------------

. tabstat part_time, by(year) statistics(mean n)

Summary for variables: part_time
     by categories of: year 

    year |      mean         N
---------+--------------------
    1975 |  .0725375    417853
    1976 |  .0733315    447134
    1977 |  .0758467    456737
    1978 |  .0781816    462091
    1979 |  .0823872    477659
    1980 |  .0838349    485955
    1981 |   .087547    481010
    1982 |     .0925    471200
    1983 |  .0942163    466140
    1984 |  .0949097    479424
    1985 |  .0962656    485750
    1986 |  .1000234    492015
    1987 |  .1030526    499580
    1988 |   .106836    507488
    1989 |  .1108182    526845
    1990 |  .1169149    557106
    1991 |   .119846    569481
    1992 |  .1219062    572104
    1993 |  .1279672    561011
    1994 |  .1319406    551900
    1995 |  .1365529    554093
    1996 |  .1449217    559164
    1997 |  .1635601    599480
    1998 |   .151335    596630
    1999 |  .2750998    772087
    2000 |  .2987814    807972
    2001 |   .296115    822015
    2002 |  .2984693    806304
    2003 |  .3449613    902304
    2004 |  .3428803    876685
    2005 |  .3646834    902964
    2006 |  .3739597    951418
    2007 |  .3720187    973849
    2008 |  .3774352    977010
    2009 |   .388338    996194
    2010 |  .3954859   1011672
    2011 |   .424915   1006945
    2012 |  .4389631    999280
    2013 |  .4360383   1012230
    2014 |  .4319689    987578
---------+--------------------
   Total |  .2521467  2.71e+07
------------------------------

. tabstat commuter, by(year) statistics(mean min max n)

Summary for variables: commuter
     by categories of: year 

    year |      mean       min       max         N
---------+----------------------------------------
    1975 |         .         .         .         0
    1976 |         .         .         .         0
    1977 |         .         .         .         0
    1978 |         .         .         .         0
    1979 |         .         .         .         0
    1980 |         .         .         .         0
    1981 |         .         .         .         0
    1982 |         .         .         .         0
    1983 |         .         .         .         0
    1984 |         .         .         .         0
    1985 |         .         .         .         0
    1986 |         .         .         .         0
    1987 |         .         .         .         0
    1988 |         .         .         .         0
    1989 |         .         .         .         0
    1990 |         .         .         .         0
    1991 |         .         .         .         0
    1992 |         .         .         .         0
    1993 |         .         .         .         0
    1994 |         .         .         .         0
    1995 |         .         .         .         0
    1996 |         .         .         .         0
    1997 |         .         .         .         0
    1998 |         .         .         .         0
    1999 |  .8939177         0         2    897841
    2000 |  .9057145         0         2    992804
    2001 |  .9074607         0         2   1017233
    2002 |  .9200045         0         2   1040533
    2003 |  .9229986         0         2   1144850
    2004 |  .9439229         0         2   1138004
    2005 |  .9480821         0         2    973229
    2006 |  .9586361         0         2   1010398
    2007 |  .9643255         0         2   1231103
    2008 |  .9668758         0         2   1227713
    2009 |  .9724587         0         2   1269038
    2010 |  .9768541         0         2   1262687
    2011 |  .9740528         0         2   1216048
    2012 |  .9756819         0         2   1196186
    2013 |  .9786681         0         2   1210816
    2014 |  .9827784         0         2   1195127
---------+----------------------------------------
   Total |  .9519334         0         2  1.80e+07
--------------------------------------------------

. tabstat fixed_term, by(year) statistics(mean n)

Summary for variables: fixed_term
     by categories of: year 

    year |      mean         N
---------+--------------------
    1975 |         .         0
    1976 |         .         0
    1977 |         .         0
    1978 |         .         0
    1979 |         .         0
    1980 |         .         0
    1981 |         .         0
    1982 |         .         0
    1983 |         .         0
    1984 |         .         0
    1985 |         .         0
    1986 |         .         0
    1987 |         .         0
    1988 |         .         0
    1989 |         .         0
    1990 |         .         0
    1991 |         .         0
    1992 |         .         0
    1993 |         .         0
    1994 |         .         0
    1995 |         .         0
    1996 |         .         0
    1997 |         .         0
    1998 |         .         0
    1999 |         .         0
    2000 |         .         0
    2001 |         .         0
    2002 |         .         0
    2003 |         .         0
    2004 |         .         0
    2005 |         .         0
    2006 |         .         0
    2007 |         .         0
    2008 |         .         0
    2009 |         .         0
    2010 |         .         0
    2011 |  .1371993    518290
    2012 |  .2093319    962209
    2013 |  .2254661   1010041
    2014 |  .2348392    987578
---------+--------------------
   Total |   .210511   3478118
------------------------------

. tabstat temp_agency, by(year) statistics(mean n)

Summary for variables: temp_agency_work
     by categories of: year 

    year |      mean         N
---------+--------------------
    1975 |         .         0
    1976 |         .         0
    1977 |         .         0
    1978 |         .         0
    1979 |         .         0
    1980 |         .         0
    1981 |         .         0
    1982 |         .         0
    1983 |         .         0
    1984 |         .         0
    1985 |         .         0
    1986 |         .         0
    1987 |         .         0
    1988 |         .         0
    1989 |         .         0
    1990 |         .         0
    1991 |         .         0
    1992 |         .         0
    1993 |         .         0
    1994 |         .         0
    1995 |         .         0
    1996 |         .         0
    1997 |         .         0
    1998 |         .         0
    1999 |         .         0
    2000 |         .         0
    2001 |         .         0
    2002 |         .         0
    2003 |         .         0
    2004 |         .         0
    2005 |         .         0
    2006 |         .         0
    2007 |         .         0
    2008 |         .         0
    2009 |         .         0
    2010 |         .         0
    2011 |  .0303633    518290
    2012 |   .047815    962209
    2013 |  .0463011   1010041
    2014 |  .0467204    987578
---------+--------------------
   Total |   .044464   3478118
------------------------------

. tabstat dur_unemp, by(year) statistics(mean min max n)

Summary for variables: dur_unemp
     by categories of: year 

    year |      mean       min       max         N
---------+----------------------------------------
    1975 |  .0010583         0       194    420492
    1976 |  .0042107         0       659    478069
    1977 |  .0026457         0       731    525374
    1978 |  .0045131         0      1200    508743
    1979 |  .0050716         0      1461    524686
    1980 |  .0069297         0      1826    549811
    1981 |  .0186285         0      2270    561343
    1982 |  .0489279         0      2852    568183
    1983 |  .0842003         0      3071    576245
    1984 |  .1317162         0      3494    590907
    1985 |  .1829499         0      3859    600547
    1986 |  .2883538         0      4224    604934
    1987 |  .3918201         0      4590    612406
    1988 |  .5116055         0      4969    619622
    1989 |   .716651         0      5437    636519
    1990 |  .9593178         0      5833    665352
    1991 |  1.213588         0      6198    691742
    1992 |  1.826802         0      6567    695533
    1993 |  2.966813         0      6932    702888
    1994 |  4.962247         0      7297    702649
    1995 |  8.936477         0      7654    707869
    1996 |  17.75798         0      7915    730476
    1997 |  84.74902         0      8036   1073672
    1998 |  84.60948         0      8660   1104961
    1999 |  86.63308         0      9038   1310450
    2000 |  90.43715         0      7398   1361469
    2001 |  86.21925         0      7606   1372355
    2002 |  88.10536         0      7971   1429723
    2003 |  95.46617         0      8200   1628539
    2004 |  98.59395         0      8490   1689765
    2005 |  45.70151         0      8490   1113327
    2006 |  46.45555         0      8490   1147172
    2007 |  96.02116         0      9404   1941369
    2008 |  87.29468         0      9404   1935803
    2009 |   80.6717         0     10406   2029594
    2010 |  77.74477         0     10406   2005436
    2011 |  73.01729         0     10406   1903737
    2012 |  73.48751         0      6830   1868754
    2013 |  70.57416         0      7259   1873411
    2014 |  75.61817         0      8402   1842057
---------+----------------------------------------
   Total |  55.92636         0     10406  4.19e+07
--------------------------------------------------

. tabstat midi_jobs, by(year) statistics(mean min max n)

Summary for variables: midi_jobs
     by categories of: year 

    year |      mean       min       max         N
---------+----------------------------------------
    1975 |         .         .         .         0
    1976 |         .         .         .         0
    1977 |         .         .         .         0
    1978 |         .         .         .         0
    1979 |         .         .         .         0
    1980 |         .         .         .         0
    1981 |         .         .         .         0
    1982 |         .         .         .         0
    1983 |         .         .         .         0
    1984 |         .         .         .         0
    1985 |         .         .         .         0
    1986 |         .         .         .         0
    1987 |         .         .         .         0
    1988 |         .         .         .         0
    1989 |         .         .         .         0
    1990 |         .         .         .         0
    1991 |         .         .         .         0
    1992 |         .         .         .         0
    1993 |         .         .         .         0
    1994 |         .         .         .         0
    1995 |         .         .         .         0
    1996 |         .         .         .         0
    1997 |         .         .         .         0
    1998 |         .         .         .         0
    1999 |         .         .         .         0
    2000 |         .         .         .         0
    2001 |         .         .         .         0
    2002 |         .         .         .         0
    2003 |  .0310024         0         2    882512
    2004 |  .0327855         0         2    874533
    2005 |  .0431554         0         2    903432
    2006 |   .049594         0         2    952071
    2007 |  .0501993         0         2    974875
    2008 |   .053134         0         2    978112
    2009 |  .0523265         0         2    997506
    2010 |  .0532397         0         2   1013135
    2011 |  .0543217         0         2   1008252
    2012 |   .053404         0         2    999325
    2013 |  .0514018         0         2   1022084
    2014 |  .0513656         0         2    996990
---------+----------------------------------------
   Total |  .0483647         0         2  1.16e+07
--------------------------------------------------

. log close
      name:  <unnamed>
       log:  /home/mansanch/Preliminars_b.log
  log type:  text
 closed on:  29 Jul 2017, 23:30:17
----------------------------------------------------------------------------------------------------------------------------------------
